<a href="https://colab.research.google.com/github/Salvini126/informatica/blob/main/Copia_di_04_Groupby_operations.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Groupby operations

Alcuni imports:

In [ ]:
%matplotlib inline
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
try:
    import seaborn
except ImportError:
    pass

pd.options.display.max_rows = 10

The example of the image in pandas syntax:

In [ ]:
df = pd.DataFrame({'key':['A','B','C','A','B','C','A','B','C'],
                   'data': [0, 5, 10, 5, 10, 15, 10, 15, 20]})
df

  key  data
0   A     0
1   B     5
2   C    10
3   A     5
4   B    10
5   C    15
6   A    10
7   B    15
8   C    20

In [ ]:
df.groupby('key').aggregate(np.sum)  # 'sum'

     data
key
A      15
B      30
C      45

In [ ]:
df.groupby('key').sum() #

And many more methods are available.

## And now applying this on some real data

We go back to the titanic survival data:

In [ ]:
df = pd.read_csv("https://raw.githubusercontent.com/Krieg2065/Python/main/titanic")

In [ ]:
df.tail()

     PassengerId  Survived  Pclass  ...   Fare Cabin  Embarked
886          887         0       2  ...  13.00   NaN         S
887          888         1       1  ...  30.00   B42         S
888          889         0       3  ...  23.45   NaN         S
889          890         1       1  ...  30.00  C148         C
890          891         0       3  ...   7.75   NaN         Q

[5 rows x 12 columns]

<div class="alert alert-success">
    <b>ESERCIZIO</b>: Usando groupby(), calcorare la media per ciascun sesso.
</div>

In [ ]:
df.groupby("Sex").mean()

        PassengerId  Survived    Pclass  ...     SibSp     Parch       Fare
Sex                                      ...
female   431.028662  0.742038  2.159236  ...  0.694268  0.649682  44.479818
male     454.147314  0.188908  2.389948  ...  0.429809  0.235702  25.523893

[2 rows x 7 columns]

<div class="alert alert-success">
    <b>ESERCIZIO</b>: Calcorare il tasso di sopravvivenza di tutti i passeggeri
</div>

In [ ]:
df.Survived.sum()/len(df)

0.3838383838383838

<div class="alert alert-success">
    <b>ESERCIZIO</b>: Calcorare il tasso di sopravvivenza di tutti i passeggeri più giovani di 25 (remember: filtering/boolean indexing).
</div>

In [ ]:
df[df.Age < 25]

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
7              8         0       3  ...  21.0750   NaN         S
9             10         1       2  ...  30.0708   NaN         C
10            11         1       3  ...  16.7000    G6         S
12            13         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
875          876         1       3  ...   7.2250   NaN         C
876          877         0       3  ...   9.8458   NaN         S
877          878         0       3  ...   7.8958   NaN         S
882          883         0       3  ...  10.5167   NaN         S
887          888         1       1  ...  30.0000   B42         S

[278 rows x 12 columns]

In [ ]:
df[df.Age < 25]["Survived"].sum() / len(df.Age)

0.1324354657687991

<div class="alert alert-success">
    <b>ESERCIZIO</b>: Trova se ci sono differenze tra i tassi di sopravvivenza dei due sessi. (consiglio: scrivi il calcolo sopra come funzione)
</div>

<div class="alert alert-success">
    <b>EXERCISE</b>: Crea un bar plot dei tassi di sopravvivenza delle varie classi nella colonna 'Pclass'(google it: bar plot con pandas).
</div>

Se sei pronto puoi passare ai operazioni di groupby avanzate su questo  [link](https://colab.research.google.com/drive/1sQf8L39u7OcmeuIg7uXKcUDBHLm95IdA?usp=sharing)